#2025 Task #05：進階容器操作
#練習：請將不同的 dict 元素合併成一個 dict
# ❏ Requirements：
# 1. 初始化三個 dict 分別為 {1:10, 2:20}, {3:30, 4:40}, {5:50, 6:60}
# 2. 利用程式將三個 dict 的結果合併之後輸出
# ❏ Sample Input： {1:10, 2:20}, {3:30, 4:40}, {5:50, 6:60} ← 預設初始化
# ❏ Sample Output： {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60} ← 畫面輸出

d1 = {1:10, 2:20}
d2 = {3:30, 4:40}
d3 = {5:50, 6:60}

d = d1.copy()
d.update(d2)
d.update(d3)

print(d) # {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}

# —————— —————— —————— 

#練習：請將列表中重複的元素移除並且將元素由大到小排列
# ❏ Requirements：
# 1. 在程式中初始化一個列表，其內容為 [1, 1, 3, 9, 7, 8, 8, 8]
# 2. 利用程式將列表中重複的元素移除
# 3. 最後請將剩餘元素由大至小排序後印出
# ❏ Sample Input： [1, 1, 3, 9, 7, 8, 8, 8] ← 預設初始化
# ❏ Sample Output： [9, 8, 7, 3, 1] ← 畫面輸出

# 第一個方法:
L = [1, 1, 3, 9, 7, 8, 8, 8]

a = []
for i in L:
    if i not in a:
        a.append(i)

a.sort(reverse=True)

print(a) # [9, 8, 7, 3, 1]

# 第二個方法:
L = [1, 1, 3, 9, 7, 8, 8, 8]
L = sorted(set(L),reverse=True)

print(L) # [9, 8, 7, 3, 1]
